In [1]:
import numpy as np
import pandas as pd

In [2]:
titanic = pd.read_html('https://github.com/ogrisel/parallel_ml_tutorial/blob/master/notebooks/titanic_train.csv', header = 0, index_col='PassengerId')[0]
titanic = titanic.drop(titanic.columns[0], axis=1) # уберем не информативную колонку
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
titanic.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

1.

In [4]:
titanic["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

##### Мужчин на борту - 577
##### Женщин на борту - 314

2.

In [5]:
titanic[titanic["Sex"] == "male"]["Pclass"].value_counts()

3    347
1    122
2    108
Name: Pclass, dtype: int64

Мужчин 2-го класса 108

In [6]:
titanic[titanic["Sex"] == "female"]["Pclass"].value_counts()

3    144
1     94
2     76
Name: Pclass, dtype: int64

3.

In [10]:
print('std:', round(titanic["Fare"].std(), 2))
print('median:', round(titanic["Fare"].median(), 2))

std: 49.69
median: 14.45

4.

In [39]:
print(f'Число выживших моложе 30: {(titanic[(titanic["Age"] < 30) & (titanic["Survived"] == 1)].shape[0]/titanic[(titanic["Age"] < 30)].shape[0]* 100):.1f}%')

Число выживших моложе 30: 40.6%

In [40]:
print(f'Число выживших старше 60: {(titanic[(titanic["Age"] > 60) & (titanic["Survived"] == 1)].shape[0]/titanic[(titanic["Age"] > 60)].shape[0]* 100):.1f}%')

Число выживших старше 60: 22.7%

5.

In [81]:
print(f"Доля выживших женщин: {(titanic[(titanic['Sex'] == 'female') & (titanic['Survived'] == 1)].shape[0]/titanic[titanic['Survived'] == 1].shape[0] * 100):.2f}%")

Доля выживших женщин: 68.13%

In [82]:
print(f"Доля выживших мужчин: {(titanic[(titanic['Sex'] == 'male') & (titanic['Survived'] == 1)].shape[0]/titanic[titanic['Survived'] == 1].shape[0] * 100):.2f}%")

Доля выживших мужчин: 31.87%

In [ ]:
6.

In [60]:
titanic["Name_"] = titanic[titanic["Sex"] == "male"]["Name"].apply(lambda x: x.split(".")[1].split(" ")[1])
titanic["Name_"].dropna()

PassengerId
1           Owen
5        William
6          James
7        Timothy
8          Gosta
         ...
884    Frederick
885        Henry
887       Juozas
890         Karl
891      Patrick
Name: Name_, Length: 577, dtype: object

In [62]:
titanic.groupby('Name_')['Name_'].count().sort_values(ascending=False).head(10)

Name_
William    35
John       25
George     14
Charles    13
Thomas     13
Henry      12
James      11
Richard    10
Edward      9
Johan       9
Name: Name_, dtype: int64

Самое популярное имя среди пассажиров Титаника мужского пола - William

7.

In [63]:
titanic[titanic["Survived"] == 1]["Age"].mean()

28.343689655172415

In [64]:
titanic[titanic["Survived"] == 0]["Age"].mean()

30.62617924528302

Средний возраст погибших выше

8.

In [5]:
for i in titanic['Pclass'].unique():
    print(f"Класс №{i}:")
    print(f"Мужчины: {(titanic[(titanic['Sex'] == 'male') & (titanic['Pclass'] == i)]['Age'].mean()):.2f}")
    print(f"Женщины: {(titanic[(titanic['Sex'] == 'female') & (titanic['Pclass'] == i)]['Age'].mean()):.2f}")

Класс №3:
Мужчины: 26.51
Женщины: 21.75
Класс №1:
Мужчины: 41.28
Женщины: 34.61
Класс №2:
Мужчины: 30.74
Женщины: 28.72

#### В среднем мужчины 1-го класса старше 40 лет
#### Мужчины всех классов в среднем старше женщин того же класса
#### В среднем люди в 1 классе старше, чем во 2-ом, а те старше представителей 3-го класса